{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "book", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "book"}, "inbound_nodes": []}, {"name": "link", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "link"}, "inbound_nodes": []}, {"name": "book_embedding", "class_name": "Embedding", "config": {"name": "book_embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 6576, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["book", 0, 0, {}]]]}, {"name": "link_embedding", "class_name": "Embedding", "config": {"name": "link_embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4134, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["link", 0, 0, {}]]]}, {"name": "dot_product", "class_name": "Dot", "config": {"name": "dot_product", "trainable": true, "dtype": "float32", "axes": 2, "normalize": true}, "inbound_nodes": [[["book_embedding", 0, 0, {}], ["link_embedding", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [1]}, "inbound_nodes": [[["dot_product", 0, 0, {}]]]}], "input_layers": [["book", 0, 0], ["link", 0, 0]], "output_layers": [["reshape_1", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}